Revit 2027 API
Stairs.GetStairsRuns Method
 Returns all the stairs run components in the stairs.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetStairsRuns()
Public Function GetStairsRuns As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetStairsRuns()
member GetStairsRuns : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 The stairs run components in the stairs.
Example
private void AddStartandEndRisers(Stairs stairs)
{
    ICollection<ElementId> runIds = stairs.GetStairsRuns();
    foreach (ElementId runId in runIds)
    {
        StairsRun run = stairs.Document.GetElement(runId) as StairsRun;
        if (null != run)
        {
            run.BeginsWithRiser = true;
            run.EndsWithRiser = true;
        }
    }
}
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace